app/controllers/dashboard_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
---
  def delete
    @user = User.find(params[:id])
    if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def update
    user_id = params[:id]
    @subjects = ['Physics', 'Maths', 'Coding', 'Mechanicsm']
    @user = User.find(user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ?, "gender" = ? WHERE "users"."id" = ?  [["email", "daro@google.com123"], ["updated_at", "2024-09-06 06:27:21.363699"], ["gender", "Female"], ["id", 24]]
---
  def update_action
    @user = User.find(params[:id])
    if @user.update(user_params)