app/controllers/registrations_controller.rb

INSERT INTO "users" ("firstname", "lastname", "birthday", "email", "phonenumber", "subject", "created_at", "updated_at", "gender") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save